app/controllers/api/v1/photos_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    begin
      property = Property.find(params[:property_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "photos" ("url", "property_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "http:hola"], ["property_id", 1], ["created_at", "2020-10-14 23:41:17.448098"], ["updated_at", "2020-10-14 23:41:17.448098"]]
---
  def create
    begin
      user = User.find(params[:user_id])
      property = Property.find(params[:property_id])
      photo = Photo.new(photo_params)
      if photo.save