app/controllers/api/v1/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      photo = Photo.find(params[:photo_id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 1]]
---
  def destroy
    begin
      photo = Photo.find(params[:photo_id])
      if photo.destroy