app/controllers/api/v1/properties_controller.rb

  def create
    begin
      puts params
      user = User.find(params[:user_id])
      property = Property.new(property_params)
      if property.save
---
INSERT INTO "properties" ("built_type", "price", "user_id", "created_at", "updated_at", "admon", "rooms") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["built_type", "Casa"], ["price", "5000000"], ["user_id", 100], ["created_at", "2020-10-26 13:15:04.876922"], ["updated_at", "2020-10-26 13:15:04.876922"], ["admon", "80000"], ["rooms", "3"]]

  def update
    property = Property.find(params[:property_id])
    if property.update(property_params)
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "properties" SET "built_type" = $1, "user_id" = $2, "updated_at" = $3 WHERE "properties"."id" = $4  [["built_type", "Casa"], ["user_id", 100], ["updated_at", "2020-10-26 13:15:05.959420"], ["id", 1]]