app/controllers/api/v1/properties_controller.rb

  def index
    begin
      user = User.find(params[:user_id])
      if user.isadmin
        properties = Property.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "properties".* FROM "properties"

  def show
    begin
      property = Property.find(params[:property_id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    begin
      property = Property.find(params[:property_id])
      if property.destroy
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 6]]

  def create
    begin
      puts params
      user = User.find(params[:user_id])
      property = Property.new(property_params)
      if property.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "properties" ("built_type", "city", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["built_type", "Casa"], ["city", "medellin"], ["user_id", 1], ["created_at", "2020-10-19 20:32:29.273092"], ["updated_at", "2020-10-19 20:32:29.273092"]]