app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "full_name", "cellphone") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def login
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]