app/jobs/photo_quality_job.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "photos" SET "accepted_lum" = ?, "accepted_foc" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["accepted_lum", 1], ["accepted_foc", 0], ["updated_at", "2020-10-15 19:05:05.463621"], ["id", 10]]
---
  def perform(photo_id)
    photo = Photo.find(photo_id)
    #f = IO.popen("python3 example.py #{photo.url}")
    f = IO.popen("python3 image_pro.py \"#{photo.url}\"")
    result = f.readlines[0].chomp.downcase
    f.close
    accepted = result.split(" ")
    photo.update_attributes(accepted_lum: accepted[0],
                            accepted_foc: accepted[1])